{
    "text": "Home » News » Sports » NFL » With starter Taylor limping,… With starter Taylor limping, Bills sign QB Josh Johnson By JOHN WAWROW October 13, 2015 5:45 pm Buffalo Bills quarterback Tyrod Taylor (5) is upended by Tennessee Titans cornerback Perrish Cox (29) after receiving a pass in the second half of an NFL football game Sunday, Oct. 11, 2015, in Nashville, Tenn. (AP Photo/Mark Zaleski) \nORCHARD PARK, N.Y. (AP) — Tyrod Taylor’s playing status is uncertain after the Bills starting quarterback hurt his left leg while rallying Buffalo to victory against Tennessee last weekend. \nThe Bills took a precautionary step in addressing their quarterback depth behind backup EJ Manuel by signing free agent Josh Johnson on Tuesday. \nThe move came a day after coach Rex Ryan said Taylor was “beat up” and “sore” following a 14-13 win against Tennessee. However, Ryan didn’t go into specifics when asked whether Taylor might be too sore to play Sunday, when Buffalo (3-2) hosts Cincinnati (5-0). \n“We all know he finished the game, but we’ll see how he’s doing,” Ryan said Monday. “We’ll be looking at him throughout the week. … But he’s sore now, I can tell you that much.” \nRyan also revealed that Taylor has been bothered by a nagging ankle injury since training camp. Ryan didn’t say when or which ankle Taylor hurt. \nRyan is expected to provide an update on Taylor’s status Wednesday, when he’s scheduled to address the media. If Taylor can’t play, Manuel would be in line to make his first start since losing the No. 1 job to Kyle Orton a month into last season. \nReplays show Taylor was initially hurt when his left leg bent awkwardly while he was dragged down by the back of his jersey by Titans linebacker Zach Brown following a 24-yard scramble midway through the fourth quarter. Brown was penalized 15 yards for a horse-collar tackle, and Taylor left the game for one play before returning for the next snap. \nThree plays later, Taylor split out as a receiver and caught a 4-yard pass from Chris Hogan before tumbling into the sideline after being struck in the right leg by Perrish Cox. Taylor got up slowly and immediately grabbed his left knee before returning to the huddle. He then hit Hogan for a go-ahead 2-yard touchdown with 5:30 left. \nTaylor was sacked four times and finished with a team-best 76 yards rushing, including a 22-yard touchdown, and completed 10 of 17 attempts for 109 yards and a touchdown. \nBills receiver Percy Harvin was impressed by the poise Taylor showed playing through the injury upon returning to the huddle after being sidelined for one snap. \n“He just told the linemen he was going to be a limited a little bit running the ball. He said, we were going to need to protect him and let’s go win the game,” Harvin told The Associated Press on Tuesday. “To come back into the game, to still be making plays, to still be able to stay focused while being injured, a lot of times that’s very difficult to do at the quarterback position.” \nNow it’s a question as to how much time — if any — Taylor might miss. \nAfter playing Cincinnati, the Bills travel to London to play Jacksonville on Oct. 25 before entering their bye week off. \nTaylor is a first-time starter after winning a three-way quarterback competition. He signed with Buffalo in March after spending four seasons as Joe Flacco’s backup in Baltimore. \nJohnson was signed a day after he was cut by Indianapolis for a second time in two weeks. He provides the Bills experienced depth after Buffalo traded veteran journeyman Matt Cassel to Dallas three weeks ago. \nIn six NFL seasons, Johnson has 1,042 yards passing, five touchdowns and 10 interceptions in 29 games, including five starts, split between Tampa Bay, Cleveland, Cincinnati and San Francisco. \nJohnson is familiar with offensive coordinator Greg Roman’s philosophy after working under him with the 49ers last season. \n“So far it’s been going well,” Johnson said. “I’ll learn more about what we’re doing for this week, but I feel pretty confident about picking things up.” \nThe Bills turned to Johnson after first expressing interest in signing Matt Simms off the Atlanta Falcons practice squad, two people familiar with the discussions told The AP. However, Simms elected to stay in Atlanta, the two people said speaking on the condition of anonymity because the Bills did not disclose that information. \nSimms is familiar with the Bills offense after spending the preseason in Buffalo before being cut on Sept. 4. \nTo make room on their roster, the Bills cut kicker Billy Cundiff a week after signing him. Cundiff replaced Jordan Gay as the team’s kickoff specialist, while veteran Dan Carpenter handled field-goal and extra-point duties. \n___ \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Topics:"
}