{
    "text": "A A \nFrom the drawers of the Top Secret Fyles: \nIf you are a fan of the Syracuse University football team, the program is literally and figuratively heading into the scariest past of the season slate. \nThe Orange, which has had its share of major injuries this season including to starting QB Terrel Hunt and, at one point, was playing with its fifth string signal-caller, has seen its 3-0 start turn into 3-2 overall. \nThe losses could mount in the coming weeks with the remaining opponents left on the schedule against quality Atlantic Coast Conference foes. \nAfter Syracuse’s 45-24 loss at South Florida last Saturday, the Orange (3-2) is now looking down the barrel of Virginia (1-4), Pittsburgh (4-1), Florida State (5-0), Louisville (2-3), Clemson (5-0), North Carolina State (4-2), Boston College (3-3). \nSU will be fortunate to win two of its final seven games, and is probably looking at a 4-8 or 5-7 finish. \n■ The University of Southern California football team, whose head coach Steve Sarkisian was fired Monday after a one-day leave of absence on Sunday attributed to health concerns, limps into Notre Dame Stadium on Saturday to take on the Fighting Irish in one of college football’s special rivalries. \nI was never a fan of Sarkisian’s rah-rah approach to coaching and it didn’t help when he issued an obscenity-laced speech at a team function last August in front of important, loyal and powerful USC boosters. Sarkisian later apologized, blaming the tirade on medications. But boosters don’t forget and, after USC’s home loss to Sarkisian’s former team, Washington, and Sarkisian not healthy enough to finish the Trojans’ Sunday practice, it was time for a change. \nCoaching major college football is now a high-pressure job. Sarkisian was 12-6 overall in his second year with the Trojans, who came off NCAA probation over the offseason when they earned the claim of 2015’s best recruiting class. The future may look bright, but right now the present is very cloudy. \n■ Dodgers backup infielder Chase Utley has appealed his two-game suspension following a hard slide into second base that injured Mets shortstop Ruben Tejada in Saturday’s Game 2 of their NLDS matchup. \nI thought it was a hard slide, a hard-nosed play by Utley, who was in the baseline. Though Utley’s slide appeared a tad late, I thought it was a legal play, and no intent to injure Tejada, who was spinning backward before the slide and in a prone position with his back to first base. If the Mets are smart, they need to concentrate on winning Game 4 at Citi Field and not get sidetracked by emotions against the former Phillie. \n■ Richie Rich’s Top 10 rankings in College Football: 1. Ohio St.; 2. Baylor; 3. TCU; 4. Mich. St.; 5. Utah; 6. Clemson; 7. Florida; 8. Texas A&M; 9. LSU; 10. Alabama. \n■ Richie Rich’s Top 10 rankings in the NFL: 1. Pats; 2. Pack; 3. Bengals; 4. Falcons; 5. Broncos; 6. Panthers; 7. Cards; 8. Giants; 9. Bills; 10. Colts. \nTimes copy editor Richard Fyle can be reached at rfyle@wdt.net  "
}